# Pandas Demo 8
<img src="img/pandas.jpg" width="250" height="250" />

## In this lecture, we will be learning how to clean data using python
<span style="color:red"><span style="font-size:200%">Wait!</span> </span>
## Why do we need to clean data
Data cleansing is also important because it improves your data quality and in doing so, increases overall productivity. When you clean your data, all outdated or incorrect information is gone â€“ leaving you with the highest quality information.

In [1]:
import pandas as pd
import numpy as np

<span style="font-size:200%">Let's create a dataframe</span>

In [2]:

people = {
    'first': ['saad','umair','fahad','hamiz',np.nan,None,'NA'],
    'last' : ['hasan','hasan','alam','habib',np.nan,np.nan,'Missing'],
    'email': ['saadhasan@gmail.com','umairhasan@gmail.com','fahadalam@gmail.com',None,np.nan,'Anonymous@yahoo.com','NA'],
    'age'  : ['19','22','20','20',None,None,'Missing']
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                 email      age
0   saad    hasan   saadhasan@gmail.com       19
1  umair    hasan  umairhasan@gmail.com       22
2  fahad     alam   fahadalam@gmail.com       20
3  hamiz    habib                  None       20
4    NaN      NaN                   NaN     None
5   None      NaN   Anonymous@yahoo.com     None
6     NA  Missing                    NA  Missing


<span style="font-size:200%">let's remove the missing values using dropna()</span>

In [5]:
df.dropna()

   first     last                 email      age
0   saad    hasan   saadhasan@gmail.com       19
1  umair    hasan  umairhasan@gmail.com       22
2  fahad     alam   fahadalam@gmail.com       20
6     NA  Missing                    NA  Missing

### All containing np.nan or None were dropped
### But why wasn't row 6 dropped

<img src="img/shocked.jpeg" width="250" height="250" />

### Row 6 contained 'NA', 'Missing' and 'anonymous@yahoo.com'
### All three of them are strings
### These are our custom missing values, we'll see how to deal with them shortly

## <span style="color:blue">How does dropna work</span>
#### dropna has these default arguments

#### dropna(axis='index',how='any')

let's try running it like this to see if the results are identical

In [6]:
df.dropna(axis='index',how='any')

   first     last                 email      age
0   saad    hasan   saadhasan@gmail.com       19
1  umair    hasan  umairhasan@gmail.com       22
2  fahad     alam   fahadalam@gmail.com       20
6     NA  Missing                    NA  Missing

#### Yup! It's the same

### First look at the axis argument
#### There are two possibilities for axis
1. index: in this case, a row is dropped
2. columns: in this case, a column is dropped

### 'how' argument
#### how argument suggests the criterea for dropping
#### The default criterea is 'any' i.e if there is any mising value in a particular row / column, the whole row / column will be dropped
#### <span style="color:red">Let's change the criterea to 'all'</span>
In this case, if all the value are None then the row / column will be dropped

In [7]:
df.dropna(axis='index',how='all')

   first     last                 email      age
0   saad    hasan   saadhasan@gmail.com       19
1  umair    hasan  umairhasan@gmail.com       22
2  fahad     alam   fahadalam@gmail.com       20
3  hamiz    habib                  None       20
5   None      NaN   Anonymous@yahoo.com     None
6     NA  Missing                    NA  Missing



#### Now let's change the axis to columns
#### Case 1
how = 'all'

In [8]:
df.dropna(axis='columns',how='all')

   first     last                 email      age
0   saad    hasan   saadhasan@gmail.com       19
1  umair    hasan  umairhasan@gmail.com       22
2  fahad     alam   fahadalam@gmail.com       20
3  hamiz    habib                  None       20
4    NaN      NaN                   NaN     None
5   None      NaN   Anonymous@yahoo.com     None
6     NA  Missing                    NA  Missing

#### See , no column  was dropped because we don't hyave a column that has missing values all the way down
#### Case2
how = 'any'

In [9]:
df.dropna(axis='columns',how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

### We get an empty dataframe because each column has atleast one missing value

## We can also check specific columns for missing values

In [16]:
df.dropna(axis='index',how='all',subset=['email'])

   first     last                 email      age
0   saad    hasan   saadhasan@gmail.com       19
1  umair    hasan  umairhasan@gmail.com       22
2  fahad     alam   fahadalam@gmail.com       20
5   None      NaN   Anonymous@yahoo.com     None
6     NA  Missing                    NA  Missing

## You might have noticed that our 'how' argument isn't doing anything

In [15]:
df.dropna(axis='index',how='all',subset=['last' , 'email'])

   first     last                 email      age
0   saad    hasan   saadhasan@gmail.com       19
1  umair    hasan  umairhasan@gmail.com       22
2  fahad     alam   fahadalam@gmail.com       20
3  hamiz    habib                  None       20
5   None      NaN   Anonymous@yahoo.com     None
6     NA  Missing                    NA  Missing

## Incase of all a row is dropped when both the subsets are missing

## Dealing With Custom Missing Values
<img src="img/clean.jpeg" width="250" height="250" />

In [17]:
df.replace('NA',np.nan,inplace=True)
df.replace('Missing',np.nan,inplace=True)

In [18]:
df

   first   last                 email   age
0   saad  hasan   saadhasan@gmail.com    19
1  umair  hasan  umairhasan@gmail.com    22
2  fahad   alam   fahadalam@gmail.com    20
3  hamiz  habib                  None    20
4    NaN    NaN                   NaN  None
5   None    NaN   Anonymous@yahoo.com  None
6    NaN    NaN                   NaN   NaN

## Now you can see, we don't have any 'Missing' or 'NA' entry in the dataframe 

## Now let's see if a value is classified as NaN value or not

In [19]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

## Sometimes when working with numerical values, we may want to fill the NaN value with a particular value for e.g here we will fill all missing values with 'Missing'

In [20]:
df.fillna('Missing')

     first     last                 email      age
0     saad    hasan   saadhasan@gmail.com       19
1    umair    hasan  umairhasan@gmail.com       22
2    fahad     alam   fahadalam@gmail.com       20
3    hamiz    habib               Missing       20
4  Missing  Missing               Missing  Missing
5  Missing  Missing   Anonymous@yahoo.com  Missing
6  Missing  Missing               Missing  Missing

In [21]:
df.fillna(0)

   first   last                 email age
0   saad  hasan   saadhasan@gmail.com  19
1  umair  hasan  umairhasan@gmail.com  22
2  fahad   alam   fahadalam@gmail.com  20
3  hamiz  habib                     0  20
4      0      0                     0   0
5      0      0   Anonymous@yahoo.com   0
6      0      0                     0   0

## If we want to make a change permanent, we will have to put inplace=True

In [23]:
df['age'].mean()

TypeError: must be str, not int

### Actually, the reason for the error is that the age in our dataframe isn't integer, it is string

### Let me show you an interesting fact

<img src="img/interesting.jpg" width="250" height="250" />

In [24]:
type(np.nan)

float

## Data Casting

In [25]:
df['age'] = df['age'].astype(int)

TypeError: int() argument must be a string, a bytes-like object or a number, not 'NoneType'

### Hmm! So why do we get this error? Because we have NaN value in the age column. NaN values are float, they can not be converted to integer
#### There are two ways to tackle this problem 
1. convert all NaN values to zero
2. Or cast the column too float

We will be using method number two

In [27]:
df['age'] = df['age'].astype(float)

In [28]:
df

   first   last                 email   age
0   saad  hasan   saadhasan@gmail.com  19.0
1  umair  hasan  umairhasan@gmail.com  22.0
2  fahad   alam   fahadalam@gmail.com  20.0
3  hamiz  habib                  None  20.0
4    NaN    NaN                   NaN   NaN
5   None    NaN   Anonymous@yahoo.com   NaN
6    NaN    NaN                   NaN   NaN

### Now let's check the data types

In [30]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

### Now age column consist of float datatype

In [32]:
a=df['age'].mean()

In [34]:
df['age'].fillna(a)

0    19.00
1    22.00
2    20.00
3    20.00
4    20.25
5    20.25
6    20.25
Name: age, dtype: float64

### While loading a csv file, we can convert all custom missing values to missing values

In [35]:
missing = ['NA','Missing']
df = pd.read_csv('developer_survey_2019/survey_results_public.csv',index_col='Respondent',na_values=missing)

### With this all the values in the list 'missing ' will be converted into NaN


<img src="img/cu.jpg" width="450" height="450" />